using FightCons.CoreNSettings;
using FightCons.WForms;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;
using static FightCons.CoreNSettings.Map;

namespace FightCons.World.Locations
{
    internal class LocationBTL : FightCons.Locations
    {
        #region Данные и настроки локации
        public enum LocationName
        {
            Deepwoods = 0,
            EastWoods = 1,
            NorthWoods = 2,
            Gigantopolis = 3,
            Market = 4,
            MainSquare = 5,
            Palace = 6,
            Administration = 7,
            Quarry = 8
        }

        public static string[][] Descript = new string[][]
        {
            //  Deepwoods
            new string[]
            {
                "Лес настолько густой, что даже ясное солнце не может пробиться сквозь плотную листву",
                "Находясь в лесу, кажется что ночная тьма отличается от тьмы здешней",
                "Пугает ни сколько дикие животные звуки, сколь их отсутствие",
                "В этом месте нет ветра, но холод пробирает до дрожи. Как и то что слышно только свое дыхание и хруст после каждого шага",
            },
            //  EastWoods
            new string[]
            {
                "Лес настолько густой, что даже ясное солнце не может пробиться сквозь плотную листву",
                "Находясь в лесу, кажется что ночная тьма отличается от тьмы здешней",
                "Пугает ни сколько дикие животные звуки, сколь их отсутствие",
                "В этом месте нет ветра, но холод пробирает до дрожи. Как и то что слышно только свое дыхание и хруст после каждого шага",
            },
            //  NorthWoods
            new string[]
            {
                "Лес настолько густой, что даже ясное солнце не может пробиться сквозь плотную листву",
                "Находясь в лесу, кажется что ночная тьма отличается от тьмы здешней",
                "Пугает ни сколько дикие животные звуки, сколь их отсутствие",
                "В этом месте нет ветра, но холод пробирает до дрожи. Как и то что слышно только свое дыхание и хруст после каждого шага",
            },
            //  Gigantopolis
            new string[]
            {
                "Огражденный и защищенный стенами городской колос стоит в авангарде среди окружающего его мрачного Глубоколесья",
                "Нагромождение гигантских жестянно-бетонных коробок стало жильем и прибежищем цивилизации. Слава отцам основателям!",
                "'Великие дома' некогда были факториями, теперь пустующие производственные сектора и отделы стали жилыми комнатами для новых рабочих",
                "Вы впервые видите настолько активную, динамичную, жизне-бурлящую картину. Глаза расходятся в стороны от " +
                "того сколько всего произошло на улицах в улетающую минуту",
                "Зажиточный господин в костюме с выделяющимся красными фрагментами и видимо опознавательными символами хвастается явно впечатлительной даме какую сумму оставил " +
                "в ресторации 'Над Карьером'",
            },
            //  Market
            new string[]
            {
                "Лавочники борются за каждый сантиметр пространства для своих товаров, и не дай бог дреной товар соседа коснется лавки другого",
                "Разнообразия выбора и однообразия неприлично завышенных цен",
                "Единственно что останавливает лавочников от массовой поножовщины наличие покупателей и только в последнюю очередь стража",
            },
            //  MainSquare
            new string[]
            {
                "Просторная главная площадь наполненная грамотно расставленными статуями и бюстами бывших королей и отцов основателей",
                "Именно здесь отцы основатели встретили 'Закат времен' - так вы услышали от\n учителя проводившего экскурс детям",
            },
            //  Palace
            new string[]
            {
                "Одна из самых ярких и ухоженных коробок именовалось дворцом. Одно из важных зданий города"
            },
            //  Administration
            new string[]
            {
                "Небольшое четырех этажное здание в кабинетах которого рассредоточились\n чиновники разных взглядов",
                "От кабинета к кабинету вы слышите обрывки разных разговоров, от шантажа до\n участия в заговоре, " +
                "от обсуждений законопроектов до грязных подробностях жизни ни о чем не говорящих вам имен",
            },
            //Quarry
            new string[]
            {
                "Карьер - дом всех малоимущих. Чем ниже опускаться, тем хуже и дешевле жилье. На вопрос насколько" +
                " хуже и дешевле - местные стесняются отвечать ",
            }
        };

        #region Настройки магазина

        //  Наименование объектов
        protected static InventoryItem healPotionItem = new InventoryItem()
        {
            Name = "Оздоровительный бальзам",
            Description = "(Восстанавливает здоровье)",
        };

        protected static InventoryItem manaPotionItem = new InventoryItem()
        {
            Name = "Бальзам крепкостный",
            Description = "(Восстанавливает ману)",
        };

        //  Настройки для магазина
        static sbyte GigantopolisMarketGoodsNum = 6;
        static sbyte GigantopolisMarketBonusesNum = 2; //  1-8

        static sbyte GigantopolisMastersGoodsNum = 4;
        static sbyte GigantopolisMastersBonusesNum = 5; //  1-8

        //TODO Придумать реест с общим
        static List<Material> Materials = new List<Material>
        {
            new Material(WoodMat, 0.4, 3),
            new Material(MixedMat, 0.3, 6),
            new Material(IronMat, 0.1, 9),
            new Material(AlloyMat, 0.1, 12),
        };
        static Dictionary<string, List<string>> WeaponsByMaterial = new Dictionary<string, List<string>>()
        {
            { WoodMat, new List<string> { "Деревянный меч", "Деревянная пика", "Деревянный топор", } },
            { MixedMat, new List<string> { "Смешанный меч", "Смешанная пика", "Смешанный топор", "Большой топор", "Секира", "Топорище", "Арбалет", "Серп", "Молот", } },
            { IronMat, new List<string> { "Железный меч", "Железная пика", "Железный топор", "Большой топор", "Секира", "Тяжелый арбалет", "Топорище", "Рапира", "Катана", "Арбалет", "Клинок", } },
            { AlloyMat, new List<string> { "Сплавленный меч", "Сплавленная пика", "Сплавленный топор", "Большой топор", "Секира", "Тяжелый арбалет", "Топорище", "Рапира", "Катана", "Арбалет", } },
        };
        static Dictionary<string, List<string>> ArmorByMaterial = new Dictionary<string, List<string>>()
        {
            { WoodMat, new List<string> { "Деревянная броня", "Деревянная кираса", "Деревянный жилет", } },
            { MixedMat, new List<string> { "Смешанная броня", "Смешанная кираса", "Смешанный жилет", "Кожаная броня" } },
            { IronMat, new List<string> { "Железная броня", "Железная кираса", "Железный жилет", } },
            { AlloyMat, new List<string> { "Сплавленная броня", "Сплавленная кираса", "Сплавленный жилет", } },
        };

        //  Рынок в поселение Решеноми
        private static Store GigantopolisMarket = new Store(31, GigantopolisMarketGoodsNum, GigantopolisMarketBonusesNum, Materials, WeaponsByMaterial, ArmorByMaterial);
        private static Store GigantopolisMasters = new Store(32, GigantopolisMastersGoodsNum, GigantopolisMastersBonusesNum, Materials, WeaponsByMaterial, ArmorByMaterial);
        #endregion
        #endregion

        #region Настройки карт

        //TODO ПОНЯТЬ КАК СПАВНИТЬ ИГРОКА В РАЗНЫЕ МЕСТА В ЗАВИСИМОСТИ ОТ ПОЗИЦИИ В СЛЕД ЛОКАЦИИ
        static List<Map> maps = new List<Map>()
        {
            #region Deepwoods
            new Map
            (
                //  Размеры
                20, 10,

                //  Карта
                new char[,]
                {
                    { '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','O','#', },//18, 1 
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','O','.','.','.','.','.','.','.','.','.','#', },//9, 8
                    { '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#', }
                },
                //  Интерактивные объекты
                new Dictionary<(int, int), Action>
                {
                    // Добавляем интерактивные объекты:
                    // Сундук на второй строке: координаты (14,1)
                    //{(14, 1), () => Map.ShowMessage("Вы нашли сундук с сокровищами!") },
                    // Сундук на девятой строке: координаты (12,8)
                    //{(12, 8), () => Map.ShowMessage("Вы нашли сундук с сокровищами!") },
                    // Точка выхода ('O') не добавляется в интерактивные объекты – для её активации нужно встать на нее
                },
                //  Тригер события
                new Dictionary<List<(int, int)>, Action>
                {
                    // Добавляем невидимые триггеры (например, ловушка)
                    //{   
                    //    new List<(int, int)>  
                    //    { 
                    //        (2, 3) 
                    //    },
                    //    () => maps[0].ShowMessage("Осторожно! Вы попали в ловушку!") 
                    //}
                },
                //  Точки входа
                new Dictionary<(int, int), Action<Hero>>
                {
                    {(18, 1), (Hero hero) =>
                        {
                            hero.HeroCoordinates = transit.DeepwoodsToNorthWoods;
                            NorthWoods(hero);
                        }
                    },
                    {(9, 8), (Hero hero) =>
                        {
                            hero.HeroCoordinates = transit.DeepwoodsToEastWoods;
                            EastWoods(hero);
                        }
                    }
                },
                (RestEvent,
                (Hero hero) =>
                {
                    RestEvent(hero);

                    List<BattleSession> battleList = new List<BattleSession>()
                    {
                        new BattleSession(1, Character.ChaRole.Wild),
                    };
                    Battles.MakeRandomBattle(hero, battleList);
                },
                0.8)
            ),
            #endregion

            #region EastWoods 
            new Map
            (
                //  Размеры
                20, 10,

                //  Карта
                new char[,]
                {
                    { '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#', },
                    { '#','.','.','.','.','.','.','.','.','.','O','.','.','.','.','.','.','.','.','#', },//10, 1 
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','O','#', },//18, 6
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#', }
                },
                //  Интерактивные объекты
                new Dictionary<(int, int), Action>
                {
                    // Добавляем интерактивные объекты:
                    // Сундук на второй строке: координаты (14,1)
                    //{(14, 1), () => Map.ShowMessage("Вы нашли сундук с сокровищами!") },
                    // Сундук на девятой строке: координаты (12,8)
                    //{(12, 8), () => Map.ShowMessage("Вы нашли сундук с сокровищами!") },
                    // Точка выхода ('O') не добавляется в интерактивные объекты – для её активации нужно встать на нее
                },
                //  Тригер события
                new Dictionary<List<(int, int)>, Action>
                {
                    // Добавляем невидимые триггеры (например, ловушка)
                    //{   
                    //    new List<(int, int)>  
                    //    { 
                    //        (2, 3) 
                    //    },
                    //    () => maps[0].ShowMessage("Осторожно! Вы попали в ловушку!") 
                    //}
                },
                //  Точки входа
                new Dictionary<(int, int), Action<Hero>>
                {
                    {(10, 1), (Hero hero) =>
                        {
                            hero.HeroCoordinates = transit.EastWoodsToDeepwoods;
                            Deepwoods(hero);
                        }
                    },
                    {(18, 6), (Hero hero) =>
                        {
                            hero.HeroCoordinates = transit.EastWoodsToGigantopolis;
                            Gigantopolis(hero);
                        }
                    },
                },
                (RestEvent,
                (Hero hero) =>
                {
                    RestEvent(hero);

                    List<BattleSession> battleList = new List<BattleSession>()
                    {
                        new BattleSession(1, Character.ChaRole.Wild),
                    };
                    Battles.MakeRandomBattle(hero, battleList);
                },
                0.8)
            ),
            #endregion

            #region NorthWoods 
            new Map
            (
                //  Размеры
                20, 10,

                //  Карта
                new char[,]
                {
                    { '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','O','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },//1, 7 
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','O','.','.','#', },//16, 8
                    { '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#', }
                },
                //  Интерактивные объекты
                new Dictionary<(int, int), Action>
                {
                    // Добавляем интерактивные объекты:
                    // Сундук на второй строке: координаты (14,1)
                    //{(14, 1), () => Map.ShowMessage("Вы нашли сундук с сокровищами!") },
                    // Сундук на девятой строке: координаты (12,8)
                    //{(12, 8), () => Map.ShowMessage("Вы нашли сундук с сокровищами!") },
                    // Точка выхода ('O') не добавляется в интерактивные объекты – для её активации нужно встать на нее
                },
                //  Тригер события
                new Dictionary<List<(int, int)>, Action>
                {
                    // Добавляем невидимые триггеры (например, ловушка)
                    //{   
                    //    new List<(int, int)>  
                    //    { 
                    //        (2, 3) 
                    //    },
                    //    () => maps[0].ShowMessage("Осторожно! Вы попали в ловушку!") 
                    //}
                },
                //  Точки входа
                new Dictionary<(int, int), Action<Hero>>
                {
                    {(1, 7), (Hero hero) =>
                        {
                            hero.HeroCoordinates = transit.NorthWoodsToDeepwoods;
                            Deepwoods(hero);
                        }
                    },
                    {(16, 8), (Hero hero) =>
                        {
                            hero.HeroCoordinates = transit.NorthWoodsToGigantopolis;
                            Gigantopolis(hero);
                        }
                    }
                },
                (RestEvent,
                (Hero hero) =>
                {
                    RestEvent(hero);

                    List<BattleSession> battleList = new List<BattleSession>()
                    {
                        new BattleSession(1, Character.ChaRole.Wild),
                    };
                    Battles.MakeRandomBattle(hero, battleList);
                },
                0.8)
            ),
            #endregion

            #region Gigantopolis
            new Map
            (
                //  Размеры
                20, 10,
                //41, 19,
                //42, 16,

                //  Карта
                new char[,]
                {
                    { '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','O','.','.','#', },//18, 1 
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','O','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','O','#', },
                    { '#','.','.','.','O','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },
                    { '#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#', },//9, 8
                    { '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#', }

                    /*{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#', },
                    //{ '#','.','.','.','.','#','#','#','#','#','#','.','.','.','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','.','.','#', },
                    //{ '#','.','.','.','.','#','#','#','#','#','.','.','.','.','#','#','#','#','#','#','#','.','.','#','#','#','#','#','#','#','#','.','.','.','#','#','#','.','.','.','#', },
                    //{ '0','.','.','.','.','#','#','#','#','.','.','.','.','.','#','#','#','#','#','#','.','.','.','#','#','#','#','#','#','#','.','.','.','#','#','#','.','.','.','.','0', },
                    //{ '#','.','.','.','.','.','#','#','#','.','.','.','.','.','.','#','#','#','#','#','.','.','.','.','#','#','#','.','.','.','.','.','.','#','#','#','.','.','.','.','#', },
                    //{ '#','#','.','.','.','.','.','#','#','.','.','.','.','.','.','.','#','#','#','#','.','.','.','.','.','#','.','.','.','.','.','.','.','#','#','#','.','.','.','.','#', },
                    //{ '#','#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#','#','#','.','.','.','.','.','.','.','.','.','#','#','#','.','.','#','#','.','.','.','#','.','#', },
                    //{ '#','#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#','#','.','.','.','.','.','.','.','.','.','#','#','#','#','.','.','#','#','.','.','#','#','.','#', },
                    //{ '#','#','#','.','.','.','.','.','.','.','.','.','#','#','.','.','.','#','.','.','.','.','.','.','.','.','.','#','#','#','#','.','.','.','#','.','.','#','#','.','#', },
                    //{ '#','#','#','#','.','.','.','.','.','.','#','.','#','#','#','.','.','.','.','.','.','.','.','.','.','.','.','#','#','#','#','#','.','.','.','.','#','#','#','.','#', },
                    //{ '#','#','#','#','.','.','.','.','.','.','#','.','#','#','#','#','.','.','.','.','#','#','#','#','.','.','.','.','#','#','#','#','.','.','.','.','#','#','#','.','#', },
                    //{ '#','#','#','#','.','.','.','.','#','#','#','.','#','#','#','.','.','.','#','#','#','#','#','.','.','.','.','#','#','#','.','.','.','.','.','.','#','#','#','.','#', },
                    //{ '#','#','#','#','.','.','.','.','#','#','#','.','#','#','#','#','.','.','#','#','#','#','#','#','.','.','.','.','#','#','.','.','.','.','.','.','#','#','#','.','#', },
                    //{ '#','#','#','#','.','.','#','#','#','#','#','.','#','#','#','#','#','#','#','#','#','#','#','#','.','.','.','.','.','#','.','.','.','.','.','.','.','#','#','.','#', },
                    //{ '#','#','#','.','.','#','#','#','#','#','#','.','#','#','#','#','#','#','#','#','#','#','#','.','.','.','.','.','.','.','.','.','.','.','#','.','.','#','#','.','#', },
                    //{ '#','#','#','.','.','#','#','#','#','#','#','.','#','#','#','#','#','#','#','#','#','#','.','.','.','.','.','.','.','.','.','.','.','#','#','.','.','#','#','.','#', },
                    //{ '#','#','#','.','.','#','#','#','#','#','#','.','.','#','#','#','#','#','#','#','#','#','.','.','.','#','.','.','.','.','.','.','.','#','#','#','.','.','#','.','#', },
                    //{ '#','#','#','#','.','#','#','#','#','#','#','.','.','.','#','#','#','#','#','#','#','#','.','.','.','#','#','.','.','.','.','.','.','#','#','#','#','.','.','.','#', },
                    //{ '#','#','#','#','#','#','#','#','#','#','#','.','.','.','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','.','.','.','#', },
                    //{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#', },
                    */

                    /*{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#', },
                    //{ '#','.','.','.','.','#','#','#','#','#','#','.','.','.','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','.','.','.','.','.','#', },
                    //{ '#','.','.','.','.','#','#','#','#','#','.','.','.','.','#','#','#','#','#','.','.','#','#','#','#','#','#','#','#','.','.','.','#','#','#','.','.','.','.','.','.','#', },
                    //{ '0','.','.','.','.','#','#','#','#','.','.','.','.','.','#','#','#','#','.','.','.','#','#','#','#','#','#','#','.','.','.','#','#','#','.','.','.','.','.','.','.','O', },
                    //{ '#','.','.','.','.','.','#','#','#','.','.','.','.','.','.','#','#','#','.','.','.','.','#','#','#','.','.','.','.','.','.','#','#','#','.','.','.','.','.','.','.','#', },
                    //{ '#','#','.','.','.','.','.','#','#','.','.','.','.','.','.','.','#','#','.','.','.','.','.','#','.','.','.','.','.','.','.','#','#','#','.','.','.','.','.','.','.','#', },
                    //{ '#','#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#','.','.','.','.','.','.','.','.','.','#','#','#','.','.','#','#','.','.','.','#','.','.','.','.','#', },
                    //{ '#','#','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','.','#','#','#','#','.','.','#','#','.','.','#','#','.','.','.','.','#', },
                    //{ '#','#','#','.','.','.','.','.','.','.','.','.','#','#','.','.','.','.','.','.','.','.','.','.','.','#','#','#','#','.','.','.','#','.','.','#','#','.','.','.','.','#', },
                    //{ '#','#','#','#','.','.','.','.','.','.','#','.','#','#','#','.','.','.','.','.','.','.','.','.','.','#','#','#','#','#','.','.','.','.','#','#','#','.','.','.','.','#', },
                    //{ '#','#','#','#','.','.','.','.','#','#','#','.','#','#','#','.','#','#','#','#','#','.','.','.','.','#','#','#','.','.','.','.','.','.','#','#','#','.','.','.','.','#', },
                    //{ '#','#','#','#','.','.','.','.','#','#','#','.','#','#','#','#','#','#','#','#','#','#','.','.','.','.','#','#','.','.','.','.','.','.','#','#','#','.','.','.','.','#', },
                    //{ '#','#','#','#','.','.','#','#','#','#','#','.','#','#','#','#','#','#','#','#','#','#','.','.','.','.','.','#','.','.','.','.','.','.','.','#','#','.','.','.','.','#', },
                    //{ '#','#','#','.','.','#','#','#','#','#','#','.','#','#','#','#','#','#','#','#','#','.','.','.','.','.','.','.','.','.','.','.','#','.','.','#','#','.','.','.','.','#', },
                    //{ '#','#','#','#','.','#','#','#','#','#','#','.','.','.','#','#','#','#','#','#','.','.','.','#','#','.','.','.','.','.','.','#','#','#','#','.','.','.','.','.','.','#', },
                    //{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#', },
                */
                },
                //  Интерактивные объекты
                new Dictionary<(int, int), Action>
                {
                    // Добавляем интерактивные объекты:
                    // Сундук на второй строке: координаты (14,1)
                    //{(14, 1), () => Map.ShowMessage("Вы нашли сундук с сокровищами!") },
                    // Сундук на девятой строке: координаты (12,8)
                    //{(12, 8), () => Map.ShowMessage("Вы нашли сундук с сокровищами!") },
                    // Точка выхода ('O') не добавляется в интерактивные объекты – для её активации нужно встать на нее
                },
                //  Тригер события
                new Dictionary<(int, int), Action>
                {

                    // Добавляем невидимые триггеры (например, ловушка)
                    //{(5, 5), () => maps[1].TriggerTrap() }
                },
                //  Точки выхода
                new Dictionary<(int, int), Action<Hero>>
                {
                    //{(3, 3), SenisusColony },
                    //{(9, 8), (Hero hero) =>
                    //    {
                    //        hero.HeroCoordinates = transit.FoothillsToValley;
                    //        Valley(hero);
                    //    }
                    //}
                },
                (RestEvent,
                (Hero hero) =>
                {
                    RestEvent(hero);
                    List<BattleSession> battleList = new List<BattleSession>()
                    {
                        new BattleSession(3, Character.ChaRole.Enemy),
                    };
                    Battles.MakeCurrentBattle(hero, battleList);
                },
                0.9)
            )
            #endregion
        };

        static Dictionary<Enum, (int, int)> SpawnPoints = new Dictionary<Enum, (int, int)>
        {
            //  Deepwoods
            { transit.BTLStartPoint, (2, 2) },
            { transit.NorthWoodsToDeepwoods, (17, 2) },
            { transit.EastWoodsToDeepwoods, (9, 7) },

            //  EastWoods
            { transit.DeepwoodsToEastWoods, (10, 2) },
            { transit.GigantopolisToEastWoods, (17, 6) },

            //  NorthWoods
            { transit.DeepwoodsToNorthWoods, (2, 7) },
            { transit.GigantopolisToNorthWoods, (16, 7) },

            //  Gigantopolis
            { transit.EastWoodsToGigantopolis, (9,7) },
            { transit.NorthWoodsToGigantopolis, (4,3) },
        };

        #endregion

        #region Локации БТЛ

        //Глубоколесье
        public static void Deepwoods(Hero hero)
        {
            List<LocationScenarioEvent> scenario = new List<LocationScenarioEvent>
            {
                #region События на карте
           
                #region Область нечести и культистов
                new LocationScenarioEvent
                (
                    0.2,
                    (hero, turn) =>
                    {
                        var conditions = new List<bool>
                        {
                            GameFormulas.CurrentCoordinates
                            (
                                (1, 1), (3, 1), (5, 1), (7, 1), (9, 1), (11, 1), (13, 1), (15, 1), (17, 1),
                                (1, 3), (3, 3), (5, 3), (7, 3), (9, 3), (11, 3), (13, 3), (15, 3), (17, 3),
                                (1, 5), (3, 5), (5, 5), (7, 5), (9, 5), (11, 5), (13, 5), (15, 5), (17, 5),
                                (1, 7), (3, 7), (5, 7), (7, 7), (9, 7), (11, 7), (13, 7), (15, 7), (17, 7)
                            ),
                        };
                        return conditions.Any(c => c);
                    },
                    (hero) =>
                    {
                            List<BattleSession> battleList = new List<BattleSession>()
                            {
                                new BattleSession(32, Character.ChaRole.Enemy),
                                new BattleSession(31, Character.ChaRole.Enemy)
                            };
                            Battles.MakeRandomBattle(hero, battleList);
                    },
                    true
                ),
                #endregion


                #endregion
            };

            //TODO изменить под кортеж var user = (locName: "Глубоколесье", Description: Descriptions(((byte)LocationName.Deepwoods), Descript));
            string[] locInfo = new string[2];

            locInfo[0] = "Глубоколесье";
            locInfo[1] = Descriptions(((byte)LocationName.Deepwoods), Descript);

            maps[0].Transition(hero, SpawnPoints, hero.HeroCoordinates, locInfo, scenario);

            while (true)
                maps[0].Transition(hero, (playerX, playerY), locInfo, scenario);


            if (GameFormulas.Vero(0.6))
            {
                List<BattleSession> battleList = new List<BattleSession>()
                {
                    new BattleSession(31, Character.ChaRole.Enemy),
                    new BattleSession(32, Character.ChaRole.Enemy),
                    new BattleSession(33, Character.ChaRole.Enemy),
                };
                Battles.MakeRandomBattle(hero, battleList);
            }
                

            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Глубоколесье\n");
                Output.TwriteLine(Descriptions(((byte)LocationName.Deepwoods), Descript), 1);

                hero.HPnMPBar(true, true);

                string quo = "\nВаши действия?\n"
                            + "1) Бродить\n"
                            + "2) Пойти в северные леса\n"
                            + "3) Пойти в восточные леса\n"
                            + "4) Отдохнуть";
                            //+ "5) Выйти из БТЛ";

                switch (Input.ChoisInput(hero, 1, 4, quo))
                {
                    case 1:
                        //TODO Бродить
                        break;
                    case 2:
                        NorthWoods(hero);
                        break;
                    case 3:
                        EastWoods(hero);
                        break;
                    case 4:
                        if (GameFormulas.Vero(0.9))
                            RestEvent(hero);
                        else
                        {
                            RestEvent(hero);

                            List<BattleSession> battleList = new List<BattleSession>()
                            {
                                new BattleSession(31, Character.ChaRole.Enemy),
                                new BattleSession(32, Character.ChaRole.Enemy),
                                new BattleSession(33, Character.ChaRole.Enemy),
                            };
                            Battles.MakeRandomBattle(hero, battleList);
                        }
                        break;
                    //case 5:
                    //    LocationVN.SpilledSpace(hero);
                    //    break;
                }
            }
        }

        //Восточный лес
        public static void EastWoods(Hero hero)
        {
            List<LocationScenarioEvent> scenario = new List<LocationScenarioEvent>
            {
                #region События на карте
           
                #region Область нечести и культистов
                new LocationScenarioEvent
                (
                    0.1,
                    (hero, turn) =>
                    {
                        var conditions = new List<bool>
                        {
                            GameFormulas.CurrentCoordinates
                            (
                                (1, 1), (3, 1), (5, 1), (7, 1), (9, 1), (11, 1), (13, 1), (15, 1), (17, 1),
                                (1, 3), (3, 3), (5, 3), (7, 3), (9, 3), (11, 3), (13, 3), (15, 3), (17, 3),
                                (1, 5), (3, 5), (5, 5), (7, 5), (9, 5), (11, 5), (13, 5), (15, 5), (17, 5),
                                (1, 7), (3, 7), (5, 7), (7, 7), (9, 7), (11, 7), (13, 7), (15, 7), (17, 7)
                            ),
                        };
                        return conditions.Any(c => c);
                    },
                    (hero) =>
                    {
                            List<BattleSession> battleList = new List<BattleSession>()
                            {
                                new BattleSession(31, Character.ChaRole.Enemy)
                            };
                            Battles.MakeRandomBattle(hero, battleList);
                    },
                    true
                ),
                #endregion


                #endregion
            };

            //TODO изменить под кортеж var user = (locName: "Глубоколесье", Description: Descriptions(((byte)LocationName.Deepwoods), Descript));
            string[] locInfo = new string[2];

            locInfo[0] = "Восточный лес";
            locInfo[1] = Descriptions(((byte)LocationName.EastWoods), Descript);

            maps[1].Transition(hero, SpawnPoints, hero.HeroCoordinates, locInfo, scenario);

            while (true)
                maps[1].Transition(hero, (playerX, playerY), locInfo, scenario);

            if (GameFormulas.Vero(0.6))
            {
                List<BattleSession> battleList = new List<BattleSession>()
                {
                    new BattleSession(31, Character.ChaRole.Enemy),
                    new BattleSession(32, Character.ChaRole.Enemy),
                    new BattleSession(33, Character.ChaRole.Enemy),
                };
                Battles.MakeRandomBattle(hero, battleList);
            }
                

            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Восточный лес\n");
                Output.TwriteLine(Descriptions(((byte)LocationName.EastWoods), Descript), 1);

                hero.HPnMPBar(true, true);

                string quo = "\nВаши действия?\n"
                           + "1) Пойти в Гигантополь\n"
                           + "2) Отдохнуть\n"
                           + "3) Вернуться в глубоколесье";

                switch (Input.ChoisInput(hero, 1, 3, quo))
                {
                    case 1:
                        Gigantopolis(hero);
                        break;
                    case 2:
                        if (GameFormulas.Vero(0.9))
                            RestEvent(hero);
                        else
                        {
                            RestEvent(hero);

                            List<BattleSession> battleList = new List<BattleSession>()
                            {
                                new BattleSession(31, Character.ChaRole.Enemy),
                                new BattleSession(32, Character.ChaRole.Enemy),
                                new BattleSession(33, Character.ChaRole.Enemy),
                            };
                            Battles.MakeRandomBattle(hero, battleList);
                        }
                        break;
                    case 3:
                        Deepwoods(hero);
                        break;
                }
            }
        }

        //Северный лес
        public static void NorthWoods(Hero hero)
        {
            List<LocationScenarioEvent> scenario = new List<LocationScenarioEvent>
            {
                #region События на карте
           
                #region Область нечести и культистов
                new LocationScenarioEvent
                (
                    0.20,
                    (hero, turn) =>
                    {
                        var conditions = new List<bool>
                        {
                            GameFormulas.CurrentCoordinates
                            (
                                (1, 1), (3, 1), (5, 1), (7, 1), (9, 1), (11, 1), (13, 1), (15, 1), (17, 1),
                                (1, 3), (3, 3), (5, 3), (7, 3), (9, 3), (11, 3), (13, 3), (15, 3), (17, 3),
                                (1, 5), (3, 5), (5, 5), (7, 5), (9, 5), (11, 5), (13, 5), (15, 5), (17, 5),
                                (1, 7), (3, 7), (5, 7), (7, 7), (9, 7), (11, 7), (13, 7), (15, 7), (17, 7)
                            ),
                        };
                        return conditions.Any(c => c);
                    },
                    (hero) =>
                    {
                            List<BattleSession> battleList = new List<BattleSession>()
                            {
                                new BattleSession(32, Character.ChaRole.Enemy),
                                new BattleSession(33, Character.ChaRole.Enemy)
                            };
                            Battles.MakeRandomBattle(hero, battleList);
                    },
                    true
                ),
                #endregion


                #endregion
            };

            //TODO изменить под кортеж var user = (locName: "Глубоколесье", Description: Descriptions(((byte)LocationName.Deepwoods), Descript));
            string[] locInfo = new string[2];

            locInfo[0] = "Северный лес";
            locInfo[1] = Descriptions(((byte)LocationName.NorthWoods), Descript);

            maps[2].Transition(hero, SpawnPoints, hero.HeroCoordinates, locInfo, scenario);

            while (true)
                maps[2].Transition(hero, (playerX, playerY), locInfo, scenario);

            if (GameFormulas.Vero(0.6))
            {
                List<BattleSession> battleList = new List<BattleSession>()
                {
                    new BattleSession(31, Character.ChaRole.Enemy),
                    new BattleSession(32, Character.ChaRole.Enemy),
                    new BattleSession(33, Character.ChaRole.Enemy),
                };
                Battles.MakeRandomBattle(hero, battleList);
            }
                

            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Северный лес\n");
                Output.TwriteLine(Descriptions(((byte)LocationName.NorthWoods), Descript), 1);

                hero.HPnMPBar(true, true);

                string quo = "\nВаши действия?\n"
                           + "1) Пойти в Гигантополь\n"
                           + "2) Отдохнуть\n"
                           + "3) Вернуться в глубоколесье";

                switch (Input.ChoisInput(hero, 1, 3, quo))
                {
                    case 1:
                        Gigantopolis(hero);
                        break;
                    case 2:
                        if (GameFormulas.Vero(0.9))
                            RestEvent(hero);
                        else
                        {
                            RestEvent(hero);

                            List<BattleSession> battleList = new List<BattleSession>()
                            {
                                new BattleSession(31, Character.ChaRole.Enemy),
                                new BattleSession(32, Character.ChaRole.Enemy),
                                new BattleSession(33, Character.ChaRole.Enemy),
                            };
                            Battles.MakeRandomBattle(hero, battleList);
                        }
                        break;
                    case 3:
                        Deepwoods(hero);
                        break;
                }
            }
        }

        //Гигантополь
        public static void Gigantopolis(Hero hero)
        {
            //  Допилить
            /*
            List<LocationScenarioEvent> scenario = new List<LocationScenarioEvent>
            {
                #region События на карте
                
                #region Область зверолова
                new LocationScenarioEvent
                (
                    0.1,
                    (hero, turn) =>
                    {
                        var conditions = new List<bool>
                        {
                            //GameFormulas.CurrentCoordinates((3, 5), (4, 5), (5, 5)),
                            GameFormulas.CurrentCoordinates(
                                (1, 1), (2, 1), (3, 1), (4, 1), (5, 1), (6, 1),
                                (1, 2), (2, 2), (3, 2), (4, 2), (5, 2), (6, 2),
                                (1, 3), (2, 3), (3, 3), (4, 3), (5, 3), (6, 3),
                                (1, 4), (2, 4), (3, 4), (4, 4), (5, 4), (6, 4)
                                ),
                        };
                        return conditions.Any(c => c);
                    },
                    (hero) =>
                    {
                            List<BattleSession> battleList = new List<BattleSession>()
                            {
                                new BattleSession(7, Character.ChaRole.Enemy),
                            };
                            Battles.MakeCurrentBattle(hero, battleList);
                    },
                    true
                ),
                #endregion

                #region Область разбойников
                new LocationScenarioEvent
                (
                    0.2,
                    (hero, turn) =>
                    {
                        var conditions = new List<bool>
                        {
                            //GameFormulas.CurrentCoordinates((3, 5), (4, 5), (5, 5)),
                            GameFormulas.CurrentCoordinates(
                                (12, 1), (13, 1), (14, 1), (15, 1), (16, 1), (17, 1), (18, 1),
                                (12, 2), (13, 2), (14, 2), (15, 2), (16, 2), (17, 2), (18, 2),
                                (12, 3), (13, 3), (14, 3), (15, 3), (16, 3), (17, 3), (18, 3),
                                (12, 4), (13, 4), (14, 4), (15, 4), (16, 4), (17, 4), (18, 4)
                                ),
                        };
                        return conditions.Any(c => c);
                    },
                    (hero) =>
                    {
                            List<BattleSession> battleList = new List<BattleSession>()
                            {
                                new BattleSession(3, Character.ChaRole.Enemy),
                            };
                            Battles.MakeCurrentBattle(hero, battleList);
                    },
                    true
                )
	            #endregion
                
                //  Не ясно нужен или нет 
                new LocationScenarioEvent
                //(
                //    (hero, turn) => true,
                //    (hero) =>
                //    {
                //        Console.WriteLine("ыфваывафыва");
                //        Console.WriteLine("ыфваывафыва");
                //        Console.WriteLine("ыфваывафыва");
                //        Console.WriteLine("ыфваывафыва");
                //        if (GameFormulas.Vero(0.8))
                //            RestEvent(hero);
                //        else
                //        {
                //            RestEvent(hero);

                //            rendering = false;
                //            //mapStartLine = -1;
                //            Console.CursorVisible = true;

                //            List<BattleSession> battleList = new List<BattleSession>()
                //            {
                //                new BattleSession(1, Character.ChaRole.Wild),
                //            };
                //            Battles.MakeRandomBattle(hero, battleList);
                //        }
                //    },
                //    true
                )

                #endregion
            };

            //TODO изменить под кортеж var user = (locName: "Глубоколесье", Description: Descriptions(((byte)LocationName.Deepwoods), Descript));
            string[] locInfo = new string[2];

            locInfo[0] = "Гигантополь";
            locInfo[1] = Descriptions(((byte)LocationName.Gigantopolis), Descript);

            maps[3].Transition(hero, SpawnPoints, hero.HeroCoordinates, locInfo, scenario);

            while (true)
                maps[3].Transition(hero, (playerX, playerY), locInfo, scenario);
            */

            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Гигантополь\n");
                Output.TwriteLine(Descriptions(((byte)LocationName.Gigantopolis), Descript), 1);

                hero.HPnMPBar(true, true);

                string quo = "\nВаши действия?\n"
                           + "1) Бродить\n"
                           + "2) Пойти на главную площадь\n"
                           + "3) Пойти на рынок\n"
                           + "4) Пойти в Дом Ремесленников\n"
                           + "5) Пойти в северный лес\n"
                           + "6) Пойти в восточный лес\n"
                           + "7) Пойти к карьеру";

                switch (Input.ChoisInput(hero, 1, 7, quo))
                {
                    case 1:
                        //TODO Бродить
                        break;
                    case 2:
                        MainSquare(hero);
                        break;
                    case 3:
                        Market(hero);
                        break;
                    case 4:
                        EneHouse(hero);
                        break;
                    case 5:
                        hero.HeroCoordinates = transit.GigantopolisToNorthWoods;
                        NorthWoods(hero);
                        break;
                    case 6:
                        hero.HeroCoordinates = transit.GigantopolisToEastWoods;
                        EastWoods(hero);
                        break;
                    case 7:
                        Quarry(hero);
                        break;
                }
            }
        }

        //Рынок
        public static void Market(Hero hero)
        {
            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Рынок\n");
                Output.TwriteLine(Descriptions(((byte)LocationName.Market), Descript), 1);

                hero.HPnMPBar(true, true);

                Console.WriteLine("\nВаши действия?\n"
                          + "1) Наблюдать и подслушивать\n"
                          + "2) Купить оружие\n"
                          + "3) Купить броню");
                Output.PayMoneyLine($"4) Купить {healPotionItem.Name}", 50, hero.Money);
                Output.PayMoneyLine($"5) Купить {manaPotionItem.Name}", 100, hero.Money);
                Console.WriteLine("6) Выйти");

                switch (Input.ChoisInput(hero, 1, 6))
                {
                    case 1:
                        //TODO Событие прослушивание  
                        break;

                    case 2:
                        GigantopolisMarket.ShowWeaponGoods(hero);
                        break;

                    case 3:
                        GigantopolisMarket.ShowArmorGoods(hero);
                        break;

                    case 4:
                        if (Output.Spent(hero, 50, healPotionItem.Name, "\nВы нищеброд! Проваливайте!\n"))
                        {
                            healPotionItem.UseItem = healPotionItem.HealPotion;
                            Inventory.ItemAdd(hero, healPotionItem);
                        }
                        break;

                    case 5:
                        if (Output.Spent(hero, 100, manaPotionItem.Name, "\nВы нищеброд! Проваливайте!\n"))
                        {
                            manaPotionItem.UseItem = manaPotionItem.ManaPotion;
                            Inventory.ItemAdd(hero, manaPotionItem);
                        }
                        break;

                    case 6:
                        Gigantopolis(hero);
                        break;
                }
            }
        }

        //Дом ремесленников 
        public static void EneHouse(Hero hero)
        {
            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Дом ремесленников\n");
                Output.TwriteLine(Descriptions(((byte)LocationName.Market), Descript), 1);

                hero.HPnMPBar(true, true);

                Console.WriteLine("\nВаши действия?\n"
                          + "1) Наблюдать и подслушивать\n"
                          + "2) Купить оружие\n"
                          + "3) Купить броню");
                Output.PayMoneyLine("4) Купить Кислоту", 30, hero.Money);
                Console.WriteLine("5) Выйти");

                switch (Input.ChoisInput(hero, 1, 5))
                {
                    case 1:
                        //TODO Событие прослушивание  
                        break;

                    case 2:
                        GigantopolisMasters.ShowWeaponGoods(hero);
                        break;

                    case 3:
                        GigantopolisMasters.ShowArmorGoods(hero);
                        break;

                    case 4:
                        if (Output.Spent(hero, 30, "Кислота", "\nВы нищеброд! Проваливайте!\n"))
                        {
                            //TODO оптимизировать процесс. Не надо создавать сто раз один и тот же объект. 
                            InventoryItem acid = new InventoryItem()
                            {
                                Name = "Кислота",
                                Description = "(Снимает броню с противника)",
                            };
                            acid.UseItem = acid.AcidPotion;
                        }
                        break;

                    case 5:
                        Gigantopolis(hero);
                        break;
                }
            }
        }

        //Главная площадь
        public static void MainSquare(Hero hero)
        {
            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Главная площадь\n");
                Output.TwriteLine(Descriptions(((byte)LocationName.MainSquare), Descript), 1);

                hero.HPnMPBar(true, true);

                string quo = "\nВаши действия?\n"
                           + "1) Войти в дворец\n"
                           + "2) Войти в канцелярию\n"
                           + "3) Вернуться";

                switch (Input.ChoisInput(hero, 1, 3, quo))
                {
                    case 1:
                        Palace(hero);
                        break;
                    case 2:
                        Administration(hero);
                        break;
                    case 3:
                        Gigantopolis(hero);
                        break;
                }
            }
        }

        //Дворец
        public static void Palace(Hero hero)
        {
            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Дворец\n");
                Output.TwriteLine(Descriptions(((byte)LocationName.Palace), Descript), 1);

                hero.HPnMPBar(true, true);

                string quo = "\nВаши действия?\n"
                           + "1) Осмотреться\n"
                           + "2) Уйти";

                switch (Input.ChoisInput(hero, 1, 2, quo))
                {
                    case 1:
                        //TODO Событие прослушивание  
                        break;
                    case 2:
                        MainSquare(hero);
                        break;
                }
            }
        }

        //Канцелярия 
        public static void Administration(Hero hero)
        {
            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Канцелярия\n");
                Output.TwriteLine(Descriptions(((byte)LocationName.Administration), Descript), 1);

                hero.HPnMPBar(true, true);

                string quo = "\nВаши действия?\n"
                           + "1) Осмотреться\n"
                           + "2) Уйти";

                switch (Input.ChoisInput(hero, 1, 2, quo))
                {
                    case 1:
                        //TODO Событие прослушивание  
                        break;
                    case 2:
                        MainSquare(hero);
                        break;
                }
            }
        }

        //Штаб вольных клинков
        /*
        public static void Lorem(Hero hero)
        {
            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Поселение Решноми\n");
                Output.TwriteLine(Dicscriptions(((byte)LocationName.Woods)), 1);

                hero.HPBar();
                hero.MPBar();

                string quo = "\nВаши действия?\n"
                           + "1) Войти в деревню\n"
                           + "2) Отдохнуть\n"
                           + "3) Вернуться в долину";

                switch (Input.ChoisInput(hero, 1, 3, quo))
                {
                    case 1:
                        VillageOrdo(hero);
                        break;
                    case 2:
                        if (GameFormulas.Vero(0.9))
                            RestEvent(hero);
                        else
                        {
                            RestEvent(hero);
                             Battles.MakeRandomBattle(hero, 31, 32, 33);
                        }
                        break;
                    case 3:
                        Vally(hero);
                        break;
                }
            }
        }

        //Дом Союза Вольных Дельцов
        public static void Lorem(Hero hero)
        {
            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Поселение Решноми\n");
                Output.TwriteLine(Dicscriptions(((byte)LocationName.Woods)), 1);

                hero.HPBar();
                hero.MPBar();

                string quo = "\nВаши действия?\n"
                           + "1) Войти в деревню\n"
                           + "2) Отдохнуть\n"
                           + "3) Вернуться в долину";

                switch (Input.ChoisInput(hero, 1, 3, quo))
                {
                    case 1:
                        VillageOrdo(hero);
                        break;
                    case 2:
                        if (GameFormulas.Vero(0.9))
                            RestEvent(hero);
                        else
                        {
                            RestEvent(hero);
                             Battles.MakeRandomBattle(hero, 31, 32, 33);
                        }
                        break;
                    case 3:
                        Vally(hero);
                        break;
                }
            }
        }

        //Дом ремесленников
        public static void Lorem(Hero hero)
        {
            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Поселение Решноми\n");
                Output.TwriteLine(Dicscriptions(((byte)LocationName.Woods)), 1);

                hero.HPBar();
                hero.MPBar();

                string quo = "\nВаши действия?\n"
                           + "1) Войти в деревню\n"
                           + "2) Отдохнуть\n"
                           + "3) Вернуться в долину";

                switch (Input.ChoisInput(hero, 1, 3, quo))
                {
                    case 1:
                        VillageOrdo(hero);
                        break;
                    case 2:
                        if (GameFormulas.Vero(0.9))
                            RestEvent(hero);
                        else
                        {
                            RestEvent(hero);
                             Battles.MakeRandomBattle(hero, 31, 32, 33);
                        }
                        break;
                    case 3:
                        Vally(hero);
                        break;
                }
            }
        }
        //Дом знаний
        public static void Lorem(Hero hero)
        {
            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Поселение Решноми\n");
                Output.TwriteLine(Dicscriptions(((byte)LocationName.Woods)), 1);

                hero.HPBar();
                hero.MPBar();

                string quo = "\nВаши действия?\n"
                           + "1) Войти в деревню\n"
                           + "2) Отдохнуть\n"
                           + "3) Вернуться в долину";

                switch (Input.ChoisInput(hero, 1, 3, quo))
                {
                    case 1:
                        VillageOrdo(hero);
                        break;
                    case 2:
                        if (GameFormulas.Vero(0.9))
                            RestEvent(hero);
                        else
                        {
                            RestEvent(hero);
                             Battles.MakeRandomBattle(hero, 31, 32, 33);
                        }
                        break;
                    case 3:
                        Vally(hero);
                        break;
                }
            }
        }
        */


        //Карьер
        public static void Quarry(Hero hero)
        {
            if (GameFormulas.Vero(0.6))
            {
                List<BattleSession> battleList = new List<BattleSession>()
                {
                    new BattleSession(31, Character.ChaRole.Enemy),
                    new BattleSession(32, Character.ChaRole.Enemy),
                    new BattleSession(33, Character.ChaRole.Enemy),
                };
                Battles.MakeRandomBattle(hero, battleList);
            }

            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Карьер\n");
                Output.TwriteLine(Descriptions(((byte)LocationName.Quarry), Descript), 1);

                hero.HPnMPBar(true, true);

                string quo = "\nВаши действия?\n"
                           + "1) Осмотреться\n"
                           + "2) Спуститься\n"
                           + "3) Уйти";

                switch (Input.ChoisInput(hero, 1, 3, quo))
                {
                    case 1:
                        //TODO Событие прослушивание  
                        break;
                    case 2:
                        QuarryBottom(hero);
                        break;
                    case 3:
                        Gigantopolis(hero);
                        break;
                }
            }
        }

        //Дно карьера
        public static void QuarryBottom(Hero hero)
        {
            if (GameFormulas.Vero(0.6))
            {
                List<BattleSession> battleList = new List<BattleSession>()
                {
                    new BattleSession(1, Character.ChaRole.Wild),
                    new BattleSession(2, Character.ChaRole.Enemy),
                    new BattleSession(3, Character.ChaRole.Enemy),
                };
                Battles.MakeRandomBattle(hero, battleList);
            }

            while (true)
            {
                Output.WriteColorLine(ConsoleColor.Cyan, "\nЛокация: ", $"Дно карьера\n");
                Output.TwriteLine(Descriptions(((byte)LocationName.Quarry), Descript), 1);

                hero.HPnMPBar(true, true);

                Output.TwriteLine("\nВаши действия?\n", 0);
                Output.TwriteLine(hero.HeroQuests.Que[3] == 2? "1) Выйти из БТЛ" : "1) Искать", 0);
                Output.TwriteLine("2) Отдохнуть\n"
                                + "3) Выбраться", 1);

                switch (Input.ChoisInput(hero, 1, 3))
                {
                    case 1:
                        //  Босс
                        if (hero.HeroQuests.Que[3] == 2)
                            LocationVN.SpilledSpace(hero);
                        else
                        {
                            if (GameFormulas.Vero(0.2) & hero.HeroQuests.Que[3] == 0)
                            {
                                hero.HeroQuests.Que[3] = 1;
                                hero.HeroQuests.MainBTL(hero);
                            }
                            else if (GameFormulas.Vero(0.6))
                            {
                                List<BattleSession> battleList = new List<BattleSession>()
                                {
                                    new BattleSession(1, Character.ChaRole.Wild),
                                    new BattleSession(2, Character.ChaRole.Enemy),
                                    new BattleSession(3, Character.ChaRole.Enemy),
                                };
                                Battles.MakeRandomBattle(hero, battleList);
                            }
                            else
                                Output.TwriteLine("Вы ничего не находите\n", 1);
                        }

                        //hero.Statistic.WoodsResearch++;
                        //Research(hero);
                        break;
                    case 2:
                        if (GameFormulas.Vero(0.9))
                            RestEvent(hero);
                        else
                        {
                            RestEvent(hero);

                            List<BattleSession> battleList = new List<BattleSession>()
                            {
                                new BattleSession(1, Character.ChaRole.Wild),
                                new BattleSession(2, Character.ChaRole.Enemy),
                                new BattleSession(3, Character.ChaRole.Enemy),
                            };
                            Battles.MakeRandomBattle(hero, battleList);
                        }
                        break;
                    case 3:
                        Quarry(hero);
                        break;
                }
            }
        }
        #endregion
    }
}
